//if【如果】   else【否则】																													【if语句】
//if   else if   else【if为假，才能执行else if，两个都为假才能else，只要有一个为真，后面的不执行】											【多分支】
//switch(判断或真假){case 1:   case 2:   default:}																							【双分支】
//do{        }while(条件或真假);																											【do while】
// for(赋值;条件判断或真假;调整;){}																											【for循环】
// while(条件或真假){}																														【while循环】
//int main(){  game()  }       void game(){   };																							【】
//int main(){  store=function  }  int function(int x,int y){int v=x*y; return v;}															【函数】
//again:   goto again;【goto后面的目标放在那里我就跳转到哪里】尽量发少用																	【goto】
//条件操作符：【exp1?exp2:exp3】====      store = (a > b ? k :i );  a>b如果成立把k赋给max,否则把吧赋给max									【条件操作符】
//移位操作符【a本身不变】<< 或者 >>   int a=3;a<<1结果是6       把该数左移1个位，就是该数二进制数左移一位；011【3】->110【6】				【位移操作符】算数右移，逻辑移
//【算数右移：右边丢弃，左边补原符号位（负数左边原符号位是1）】【逻辑右移：右边丢弃，左边补0】
//按位与：【&】   两个二进制，只要有零，就按位与零，两个都为1，就按位与1；    例如：3&5=1													【按位与操作符&】
//按位或：【|】   两个二进制，只要有1即使都为1，就按位或1，两个都为0，就按位或0；      例如：3|5=7											【按位或操作符|】
//二进制中最高位的符号位也遵从符号位运算；
//【*=,/=,+=,-=,%=,==,连续赋值a=b=x+1】;
//【按位取反~】数值在内存中存储的二进制，按位取反，1的变0.0的变1；符号位也变；a=-1;b=~a;则b=0;												【按位取反~】
//逗号表达式,(表达式，表达式2，表达式3，表达式4)//结果是以最后一个是式子决定，但过程中别的变量的改变是有效的；																							【逗号表达式】





